система_реагирования_на_ЧС/src/BusinessProcesses/ЛиквидацияЧС/ЛиквидацияЧС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ЛиквидацияЧС</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>Ликвидирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>DocumentRef.Событие</types>
    </type>
  </attributes>
  <attributes>
    <name>ОперативнаяСводка</name>
    <type>
      <types>DocumentRef.ОперативнаяСводка</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяЗадачаБыла</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланыРеагирования</name>
    <attributes>
      <name>План</name>
      <type>
        <types>DocumentRef.ПланРеагирования</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригады</name>
    <attributes>
      <name>Бригады</name>
      <type>
        <types>DocumentRef.Бригада</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Доклады</name>
    <attributes>
      <name>Доклады</name>
      <type>
        <types>DocumentRef.Доклады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

система_реагирования_на_ЧС/src/BusinessProcesses/ЛиквидацияЧС/ObjectModule.bsl
Процедура УсловиеПроверкаУсловия(ТочкаМаршрута, Результат)
	Результат=Ложь;
	Если Ликвидирован Тогда
		Результат=Истина;
	КонецЕсли;
КонецПроцедуры

Процедура СозданиеСобытияПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
		Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="Создать и заполнить документ событие";
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеОСПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="Создать и заполнить оперативную сводку";
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеПланаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="разработать план реагирования на ЧС";
	КонецЦикла;
КонецПроцедуры

Процедура ОповещениеСпасателейМЧСПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="начать сбор спасателей МЧС";
	КонецЦикла;
КонецПроцедуры

Процедура СозданиеБригадыПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="сформировать бригаду";
	КонецЦикла;
КонецПроцедуры

Процедура НаписаниеДокладаПриСозданииЗадач(ТочкаМаршрута, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Задание="доложить о результатах выполнения плана";
	КонецЦикла;
КонецПроцедуры


Процедура СозданиеСобытияПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	Если (Событие.Ссылка=Документы.Событие.ПустаяСсылка()) Тогда
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры

Процедура СозданиеОСПриВыполнении(ТочкаМаршрута, Задача, Отказ)
	Если (ОперативнаяСводка.Ссылка=Документы.ОперативнаяСводка.ПустаяСсылка()) Тогда
		Отказ=Истина;
	КонецЕсли;
КонецПроцедуры
